'''Срезы и индексы одномерных массивов
 выполняются так же как со списками'''

'Двумерные массивы:'

import numpy as np

arr = np.arange(12).reshape(3, 4)  # [[ 0  1  2  3]
                                   #  [ 4  5  6  7]
                                   #  [ 8  9 10 11]]

arr[1][1]  # 5  [индекс строки][индекс столбца] или [..., ...]
arr[1, 3]  # 7  ...

# срез матрицы:
arr[0:2, 0:2]  # [[0 1]      так же [:2, :2]
               #  [4 5]]

arr[1:3, 1:4]  # [[ 5  6  7]
               #  [ 9 10 11]]

arr[arr > 5]  # [ 6  7  8  9 10 11]
