import numpy as np
import pandas as pd

'Создаём Multi_Index DataFrame c внешними и внутреними индексами'

out_ind = ['T1', 'T1', 'T1', 'T2', 'T2', 'T2']
ins_ind = [1, 2, 3, 1, 2, 3]
ind_hier = list(zip(out_ind, ins_ind))
# ind_hier вернёт: [('T1', 1), ('T1', 2), ('T1', 3), ('T2', 1), ('T2', 2), ('T2', 3)]
mult_ind = pd.MultiIndex(levels=[['T1', 'T2'], [1, 2, 3]],
                         codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])
# mult_ind = предварительно:
# MultiIndex([('T1', 1),
#             ('T1', 2),
#             ('T1', 3),
#             ('T2', 1),
#             ('T2', 2),
#             ('T2', 3)],
#            )

'''Эта DataFrame имеет 2 уровня индексов - 'T1', 'T2'
   и в каждом есть подиндексы - 1, 2, 3
   ну и соответственно столбцы - 'X', 'Y' 
   такая DataFrame может называться Index Hierarchy (индекс ерархия)'''
mult_ind_df = pd.DataFrame(np.random.randn(6, 2), mult_ind, ['X', 'Y'])
# результат:
#              X         Y
# T1 1  1.027523 -2.555480
#    2 -0.697470 -0.572462
#    3  0.360392 -1.045947
# T2 1 -1.095473 -0.045732
#    2 -0.737823  1.752872
#    3 -0.668454  0.426108

'''Все результаты что будут ниже будут рандомными 
   и не будут соответствовать таблице DataFrame выше,
   т.к. при каждом новом запуске кода, генерируется новая DataFrame'''

'Рассмотрим варианты получения данных из такой DataFrame'
mult_ind_df.loc['T1']  # получаем срез данных 'T1'
#           X         Y
# 1  0.517157  0.363241
# 2  1.592751  0.307122
# 3  0.213480 -0.118680

mult_ind_df.loc['T1'].loc[2]  # получаем срез данных из 'T1' 2 строка
# X    0.935870
# Y    0.405382
# Name: 2, dtype: float64

'можно именовать индексы'
mult_ind_df.index.names  # [None, None]  у индексов нет имён

mult_ind_df.index.names = ['Type', 'Numbers']  # задаём имена
#                      X         Y
# Type Numbers
# T1   1       -2.279319 -3.450045
#      2        0.472512 -1.042313
#      3        1.387199 -0.172488
# T2   1       -0.170833  0.800578
#      2       -2.340646 -0.777056
#      3       -1.183924  1.425619

'теперь при вызове информации из DataFrame:'
mult_ind_df.loc['T1']
#                 X         Y
# Numbers
# 1        0.368994 -0.617639
# 2       -0.187847 -0.297447
# 3        1.165191 -1.315393

"В 'T1' ряд 3:"
mult_ind_df.loc['T1'].loc[3]
# X   -1.480813
# Y    0.691122
# Name: 3, dtype: float64

"В 'T1', ряд 3, значение в столбце Y:"
mult_ind_df.loc['T1'].loc[3]['Y']
# 0.9102807210666809


"Получение данных с помощью xs() function:"
mult_ind_df.xs('T1')  # получаем срез данных 'T1'
#                 X         Y
# Numbers
# 1       -1.092540 -0.588670
# 2        0.013929 -0.021606
# 3       -0.643547 -0.287076

"получаем строки с индексом 2 во всех 'старших' группах('T1', 'T2')"
mult_ind_df.xs(2, level='Numbers')
#              X         Y
# Type
# T1   -0.575873  0.920909
# T2    1.802897 -0.130720
